{
  "main": {
    "name": "Ujjwal sharma",
    "occupation": "Full Stack Developer",
    "description": "MERN stack",
    "image": "mypic.jpg",
    "bio": "An Engineering student pursuing B.tech and a Front-End Developer having a experience of working on multiple projects using React-JS and React-Native both from scratch. Constructed multiple successful projects during my journey. A mentor and speaker , guiding many students with there career. Always open for new oppurtunities and challanges.",
    "contactmessage": "Get in touch with me to receive further details, get coached or anything else.",
    "email": "ujjwxls@gmail.com",
    "phone": "+91-9643 679978",
    "address": {
      "city": "Delhi",
      "country": "india"
    },
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/ujjwal.sharma55",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/codeujjwal/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/ujjwalxsharma/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/codeujjwal",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "IMS Engineering college",
        "degree": "B.tech (CSE)",
        "graduated": "Pursuing",
        "description": ""
      },
      {
        "school": "St. John's Academy",
        "degree": "Higher secondary School",
        "graduated": "secured 71% in PCM with CS",
        "description": ""
      },
      {
        "school": "St. John's Academy",
        "degree": "High School",
        "graduated": "secured 8.4 CGPA",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "GetMentor",
        "title": "Founder",
        "duration": "A Year",
        "description": "GetMentor.live offers personalized mentorship for tech careers, including Frontend and Full-Stack programs. Gain expert guidance, build live projects, and receive support until you secure your dream job."
      },
      {
        "company": "Fracto",
        "title": "Senior Software Engineer",
        "duration": "Few Months",
        "description": "Creating a SAAS application for accouting services, where you can manage all invoices and expenses via company and manage cash flow through it"
      },
      {
        "company": "Ruptok Fintech",
        "title": "FrontEnd Developer",
        "duration": "A Year and Half",
        "description": "I developed an admin panel from scratch using React for a P2P mobile app, and collaborated on a scalable web app for customers to buy, sell, bid, and manage activities."
      },
      {
        "company": "SQUAREWARE",
        "title": "React Native Developer",
        "duration": "Few Months",
        "description": "Worked on project 'GETYOUPRO' for helping sportspersons to upload there videos to get feedback or review from other pro players on that platform to improve themselves built the app from scratch using RN cli for android & IOS both"
      },
      {
        "company": "ANDWEMET",
        "title": "Full Stack Developer",
        "duration": "Few Months",
        "description": "Created the pixel perfect UI for there App(ANDWEMET) using react native with the team and integrated the API's uding by creating functions and adding features to it by using them and tested the app"
      },
      {
        "company": "REDPOSITIVE",
        "title": "React Native Developer",
        "duration": "Half Year",
        "description": "Worked on multiple projects as per them and created projects from scratch and delivered on time to the clients"
      },
      {
        "company": "YLURN",
        "title": "React Native Developer",
        "duration": "Few Months",
        "description": "Created the Native components for mobile UI for there App(YLURN) using EXPO which was already createrd in react JS amd then converted them to react native components and integrated backend and did testing"
      }
    ],
    "skills": [
      {
        "name": "JavaScript"
      },
      {
        "name": "React JS"
      },
      {
        "name": "React Native"
      },
      {
        "name": "Git"
      },
      {
        "name": "NodeJS"
      },
      {
        "name": "Databases"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "category": "At GetMentor.live, we offer personalized mentorship programs to help tech professionals thrive. Choose from Frontend or Full-Stack Ninja Mentorship to gain expert guidance, build live projects, and achieve your career goals. Our programs provide continuous support until you secure your dream job, bridging the gap between aspirations and success.",
        "image": "getMentor.png",
        "url": "https://www.getmentor.live/",
        "status": 0
      },
      {
        "category": "I built the Fracto, an AI-driven platform for financial management. It features business banking, automated revenue recognition, smart contracts, and escrow management. The site showcases testimonials, various pricing plans, and support, inviting users to start a 15-day trial and connect via contact details",
        "image": "fracto.png",
        "url": "https:/fracto.tech/",
        "status": 1
      },
      {
        "category": "I'm developing FractoPay, a mobile app for managing payouts with UPI, NEFT, and IMPS. It ensures transactions stay within assigned limits, providing a streamlined and secure payout experience.",
        "image": "fractoPay.png",
        "url": "https:/fracto.tech/",
        "status": 0
      },
      {
        "category": "I worked as a frontend developer for Ruptok, a company offering gold loans and facilitating gold transactions through its web and mobile e-commerce platform. My role involved enhancing the user experience for buying, selling, and managing gold loans online.",
        "image": "ruptok.png",
        "url": "https://ruptok.com",
        "status": 1
      },
      {
        "category": "I worked at Ylurn, developing the web and mobile frontend for a platform that supports online teaching, course sales, live classes, and test portals. The platform also features digital content libraries and student management tools, providing a comprehensive solution for growing and managing online education businesses.",
        "image": "ylurn.png",
        "url": "https://ylurn.com",
        "status": 0
      },
      {
        "category": "I developed the website for AAAS Industries, showcasing their engineering solutions like Special Purpose Machines, welding fixtures, proto parts, CMM services, and press tools. The site includes details on facilities, services, customer testimonials, and contact information, enhancing their online presence and customer engagement.",
        "image": "aaas.png",
        "url": "https://aaasind.com/",
        "status": 1
      }
    ]
  }
}
